 // ------------------------------------4 ВИДА ЦИКЛОВ------------------------------
 // ----------------------------цикл for
 // чаще всего используется для того чтоб пробежаться по массивам
var i = 0;

var arr = [1, 2, 3],
	len = arr.length;

for (i = 10; i > 0; i--) {
	//console.log (i);
}

// ------------------------------цикл for in
// чаще всего используется для того чтоб пробежаться по объектам
var obj = {
	propp: 'one',
	proppSecond: 'two'
},
prop;

// for (prop in obj) {
// 	if (obj.hasOwnProperty(prop)) {
// 		console.log (prop + '--:--' + obj[prop]);
// 	}
// }

// ------------------------------цикл while
// var k = 0;

// while (k < 10) {
// 	console.log (k++);
// }

//--------------------------------цикл do while
var h = 0;
do {
	//console.log (h++)
} while (h < 1);